ServiceEnergy/Repeater/CC1310R.c
/*
 *  ======== CC1310_LAUNCHXL_sendExtFlashByte ========
 */
void CC1310_LAUNCHXL_sendExtFlashByte(PIN_Handle pinHandle, uint8_t byte)
{
    PIN_setOutputValue(pinHandle, CC1310_LAUNCHXL_SPI_FLASH_CS, 0);
    uint8_t i;
    for(i = 0; i < 8; i++){
        PIN_setOutputValue(pinHandle, CC1310_LAUNCHXL_SPI0_CLK, 0);
        PIN_setOutputValue(pinHandle, CC1310_LAUNCHXL_SPI0_MOSI, (byte >> (7 - i)) & 0x01);
        PIN_setOutputValue(pinHandle, CC1310_LAUNCHXL_SPI0_CLK, 1);
    }
    PIN_setOutputValue(pinHandle, CC1310_LAUNCHXL_SPI_FLASH_CS, 1);
}

/*
 *  ======== CC1310_LAUNCHXL_shutDownExtFlash ========
 */
void CC1310_LAUNCHXL_shutDownExtFlash(void)
{
    PIN_Config extFlashPinTable[] = {
        CC1310_LAUNCHXL_SPI_FLASH_CS | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL | PIN_INPUT_DIS | PIN_DRVSTR_MED,
        CC1310_LAUNCHXL_SPI0_CLK | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_INPUT_DIS | PIN_DRVSTR_MED,
        CC1310_LAUNCHXL_SPI0_MOSI | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_INPUT_DIS | PIN_DRVSTR_MED,
        CC1310_LAUNCHXL_SPI0_MISO | PIN_INPUT_EN | PIN_PULLDOWN,
        PIN_TERMINATE
    };
    PIN_State extFlashPinState;
    PIN_Handle extFlashPinHandle = PIN_open(&extFlashPinState, extFlashPinTable);

    uint8_t extFlashStartup = 0xAB;
    uint8_t extFlashShutdown = 0xB9;

    CC1310_LAUNCHXL_sendExtFlashByte(extFlashPinHandle, extFlashStartup);
    CC1310_LAUNCHXL_sendExtFlashByte(extFlashPinHandle, extFlashShutdown);

    PIN_close(extFlashPinHandle);
}

//Переменная для определения RSSI
extern RF_Handle rfHandle; //Определена в EasyLink.c. Убрать тип static/

//RTOS Variables
Task_Params rxTaskParams;
Task_Struct rxTask;
Char rxTaskStack[RFTASKSTACKSIZE];

Task_Params txUARTParams;
Task_Struct txUARTTask;
Char txUARTStack[UARTTASKSTACKSIZE];

Semaphore_Handle ReadyForUART;
Semaphore_Struct ReadyForUARTStruct;


//Easy Link Variables
EasyLink_RxPacket rxPacket =  { {0}, 0, 0, {0} };     // Пакет данных для передачи по радиоканалу
EasyLink_TxPacket txPacket =  { {0}, 0, 0, {0} };     // Пакет данных для передачи по радиоканалу

uint32_t DeviceID;                                    // Присваивается в процедуре GSM_GetSIMNumber() модуля sim800_hub.c

//UART Variables
UART_Handle uart;
UART_Params uartParams;

//GLOBAL Variable
int16_t AccX[20],AccY[20],AccZ[20];
int8_t rssi1 ;
//GLOBAL Variable
unsigned int ADCValue[40],ADCValue2[40];
signed int adc_value1;
uint16_t size_of_print;
char str[800];

void RFModule_init(void);
void UARTModule_init(void);
void rfEasyLinkRxFnx(UArg arg0, UArg arg1);
void txUARTFnx(UArg arg0, UArg arg1);

//         >>>>>>>>>>>>>>>>>>>> main <<<<<<<<<<<<<<<<<<<<<<<<<<<<
int main()
{
    Task_Params rxTaskParams;
    Task_Params txUARTaskParams;
    Semaphore_Params ReadyForUARTParams;

    //Init Section
    Power_init(); //Это было в процедуре board_initGeneral()

    if (PIN_init(BoardGpioInitTable) != PIN_SUCCESS) {while (1);} //Установка семафоров для GPIO_init()
    GPIO_init();        //Аппаратная настройка портов ВВ
    UARTModule_init();  //UART init

    //Определяем Задачу в которой крутится функция приема пакета по радио rfEasyLinkTxFnx()
    Task_Params_init(&rxTaskParams);
    rxTaskParams.stackSize = RFTASKSTACKSIZE;
    rxTaskParams.priority = 1;
    rxTaskParams.stack = &rxTaskStack;
    Task_construct(&rxTask, (Task_FuncPtr)rfEasyLinkRxFnx, &rxTaskParams, NULL); //Поцедура rfEasyLinkRxFnx()

    //Определяем Задачу в которой крутится функция передачи пакета по UART
    Task_Params_init(&txUARTaskParams);
    txUARTaskParams.stackSize = UARTTASKSTACKSIZE;
    txUARTaskParams.priority = 1;
    txUARTaskParams.stack = &txUARTStack;
    Task_construct(&txUARTTask, (Task_FuncPtr)txUARTFnx, &txUARTaskParams, NULL); //Поцедура rfEasyLinkRxFnx()

    Semaphore_Params_init(&ReadyForUARTParams);   //Семафор готовности передачи по RF каналу
    ReadyForUARTParams.mode=Semaphore_Mode_BINARY;
    Semaphore_construct(&ReadyForUARTStruct, 0, &ReadyForUARTParams);
    ReadyForUART = Semaphore_handle(&ReadyForUARTStruct);

    BIOS_start(); //Передаем управление RTOS
}

// Init RF Module
//---------------------------------------------------------------------------------------
void RFModule_init(void)
{
  //  uint8_t addrFilter[EASYLINK_MAX_ADDR_SIZE * EASYLINK_MAX_ADDR_FILTERS] = {0xAA,0xA1};
    //uint8_t addrFilter[EASYLINK_MAX_ADDR_SIZE * EASYLINK_MAX_ADDR_FILTERS] = {0xAA, 0xE9,0xA1,0xA2,0xA3,0xA4,0xA5};
    EasyLink_init(EasyLink_Phy_Custom);
  //   EasyLink_setRfPwr(12);
  //  EasyLink_enableRxAddrFilter(addrFilter, 1, 2); //Для первой строчки 2, для второй 7
}

// Init UART Module
//---------------------------------------------------------------------------------------
void UARTModule_init(void)
{
    UART_init();
    UART_Params_init(&uartParams);
    uartParams.writeDataMode = UART_DATA_BINARY;
    uartParams.readDataMode = UART_DATA_BINARY;
    uartParams.readReturnMode = UART_RETURN_FULL;
    uartParams.readEcho = UART_ECHO_OFF;
    uartParams.stopBits = UART_STOP_ONE;
    uartParams.baudRate = 115200;
    uartParams.readMode = UART_MODE_BLOCKING;
    //uartParams.writeCallback = writeCallback; //Прерывание
    uart = UART_open(0, &uartParams);
    if (uart == NULL) { while (1); }
}


// Эта функция определена как задача BIOS, при первом запуске инициализация RF модуля
// потом вечный цикл прослушки эфира, после приема пакета выставляет семафор rxDoneSem
// Данные акселерометра по 2 байта на компоненту старшие байты добиваем нулями
// В payload принимаем 20 троек AccX,AccY,AccZ по 2 байта
//---------------------------------------------------------------------------------------
void rfEasyLinkRxFnx(UArg arg0, UArg arg1)
{
//uint32_t DeviceID_rcv;
    RFModule_init(); //Инициализация RF модуля До запуска BIOS - не работает, поскольку пользуется семаформами
    while(1){
        //EasyLink_receiveAsync(rxDoneCb, 0); //Функция EasyLink API. Вызывает функцию rxDoneCb()
        if(EasyLink_receive(&rxPacket)==EasyLink_Status_Success) {
            GPIO_toggle(LED1);
            //Здесь можно прочесть RSSI
            rssi1  = rxPacket.rssi;
            //Режим приема пакета текстовых данных
            if(rxPacket.payload[0] == MASTER_ID_DEBUG_S ){
                //DeviceID_rcv = rxPacket.payload[3] | (rxPacket.payload[2]<<8) | (rxPacket.payload[1]<<16); //Собираем DeviceID_rcv
                Semaphore_post(ReadyForUART);
                Task_sleep(10000); //10 mS Время на передачу
            }
        }
    }
}

//Передаем принятые и декодированные данные в UART
//Сначала собираем Payload в общий буфер, возможно, в последствии будем фильтровать данные
//Потом пересылаем в UART в виде текстовых строк
//---------------------------------------------------------------------------------------
void txUARTFnx(UArg arg0, UArg arg1)
{
int i;
    while(1){
//Здесь
        Semaphore_pend(ReadyForUART, BIOS_WAIT_FOREVER);//Ждём семафора
        for(i=0; i<rxPacket.len; i++ )
        {
            txPacket.payload[i] = rxPacket.payload[i];
        }

        txPacket.payload[0] = MASTER_ID_DEBUG_R;
               txPacket.len        = 128; //
               txPacket.dstAddr[0] = GROUP_CODE;
               txPacket.absTime = 0;

               EasyLink_transmit(&txPacket); //Функция библиотеки EasyLink

               //Semaphore_post(ReadyForBlink);
               Task_sleep(100000);

         Task_sleep(10000); //10 mS Время на передачу
    }//End of while
}





